In [4]:
import pandas as pd

In [5]:
df=pd.read_csv("titanic.csv")

In [6]:
##Filtering passengers older than 25 and in 1st class
df[(df["age"]>25)&(df["pclass"]==1)]

,survived,pclass,name,sex,age,fare,sibsp,parch
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
5,0,1,"McCarthy, Mr. Timothy J",male,54.0,51.8625,0,0
10,1,1,"Bonnell, Miss. Elizabeth",female,58.0,26.5500,0,0
20,1,1,"Sloper, Mr. William Thompson",male,28.0,35.5000,0,0
...,...,...,...,...,...,...,...,...
693,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,50.4958,0,0
696,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,52.5542,1,1
697,0,1,"Carlsson, Mr. Frans Olof",male,33.0,5.0000,0,0
703,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,83.1583,0,1
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0

In [7]:
##Selecting only specific columns
df[["name","age","pclass","survived"]]

                                                  name   age  pclass  survived
0                              Braund, Mr. Owen Harris  22.0       3         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       1         1
2                               Heikkinen, Miss. Laina  26.0       3         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       1         1
4                             Allen, Mr. William Henry  35.0       3         0
..                                                 ...   ...     ...       ...
709               Rice, Mrs. William (Margaret Norton)  39.0       3         0
710                              Montvila, Rev. Juozas  27.0       2         0
711                       Graham, Miss. Margaret Edith  19.0       1         1
712                              Behr, Mr. Karl Howell  26.0       1         1
713                                Dooley, Mr. Patrick  32.0       3         0

[714 rows x 4 columns]

In [10]:
##accessing rows 5 to 15
df.iloc[5:16]

,survived,pclass,name,sex,age,fare,sibsp,parch
5,0,1,"McCarthy, Mr. Timothy J",male,54.0,51.8625,0,0
6,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,3,1
7,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,0,2
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,1,0
9,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,1,1
10,1,1,"Bonnell, Miss. Elizabeth",female,58.0,26.5500,0,0
11,0,3,"Saundercock, Mr. William Henry",male,20.0,8.0500,0,0
12,0,3,"Andersson, Mr. Anders Johan",male,39.0,31.2750,1,5
13,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,0,0
14,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,16.0000,0,0
15,0,3,"Rice, Master. Eugene",male,2.0,29.1250,4,1